user_info = [
    {'username': '15210559392', 'password': 'mengyao2016'}, {"username": "18511617252", "password": "hylx123456"},
    {"username": "18511792701", "password": "mxj18511792701"},
    {"username": " 15652569788", "password": "syy20221014"}, {"username": "13126853060", "password": "li123456"},
    {"username": "18500091860", "password": "wfhy1860"}, {"username": "17319112983", "password": "nzz123456"},
    {"username": "18500090633", "password": "txftxf123"}, {"username": "18518655506", "password": "wm5201314."},
    {"username": "13120045009", "password": "wfhy1234"},
    {"username": "18513238308", "password": "123456zxc"}, {"username": "18500090833", "password": "wfhy0833"},
    {"username": "13220119096", "password": "wfhysci73"}, {"username": "18500090677", "password": "wfhy0677"},
    {"username": "17710023803", "password": "A6666666"},
    {"username": "18500090277", "password": "A8888888"}, {"username": "18518655507", "password": "zgzw@123"}
]
# user_info = [{'username': '15210559392', 'password': 'mengyao2016'}]
# user_info = [{"username": "18511792701", "password": "mxj18511792701"}]
# user_info = [{"username": "18500090277", "password": "A8888888"}]
# user_info = [{"username": "13126853060", "password": "li123456"}]
# 失败:
# {"username": "15652667077", "password": "wfhysci70"}
min_limit = 51200
headers_list = {
    'Host': 'kns.cnki.net.forest.vpn358.com',
    'Connection': 'keep-alive',
    'Pragma': 'no-cache',
    'Cache-Control': 'no-cache',
    'sec-ch-ua': '" Not;A Brand";v="99", "Google Chrome";v="97", "Chromium";v="97"',
    'Accept': 'text/html, */*; q=0.01',
    'Content-Type': 'application/x-www-form-urlencoded; charset=UTF-8',
    'X-Requested-With': 'XMLHttpRequest',
    'sec-ch-ua-mobile': '?0',
    'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/97.0.4692.71 Safari/537.36',
    'sec-ch-ua-platform': '"Windows"',
    'Origin': 'http://kns.cnki.net.forest.vpn358.com',
    'Sec-Fetch-Site': 'same-origin',
    'Sec-Fetch-Mode': 'cors',
    'Sec-Fetch-Dest': 'empty',
    'Referer': 'http://kns.cnki.net.forest.vpn358.com/kns8/defaultresult/index',
    'Accept-Encoding': 'gzip, deflate, br',
    'Accept-Language': 'zh-CN,zh;q=0.9'
}

choice_moudle = {'subjects':
                     {'info':
                          {'临床医学': 'E060', '外科学': 'E066', '肿瘤学': 'E072', '中医学': 'E056', '心血管系统疾病': 'E062', '内分泌腺及全身性疾病': 'E065', '儿科学': 'E069', '神经病学': 'E070', '妇产科学': 'E068', '眼科与耳鼻咽喉科': 'E073', '泌尿科学': 'E067', '消化系统疾病': 'E064', '医药卫生方针政策与法律法规研究': 'E053', '中药学': 'E057', '急救医学': 'E077', '药学': 'E079', '感染性疾病及传染病': 'E061', '口腔科学': 'E074', '呼吸系统疾病': 'E063', '预防医学与卫生学': 'E055'},
                      'field': '专题子栏目代码'},
                 'study_level':
                     {'info': {'技术研究-临床研究': '132', '技术开发': '16', '应用基础研究': '22', '工程与项目管理': '15', '工程研究': '14', '实用工程技术': '17', '技术研究-临床医学试验研究': '131', '学科教育教学': '2R', '技术研究': '13', '开发研究-管理研究': '243', '应用研究': '23', '开发研究': '24', '基础研究': '11', '开发研究-政策研究': '241', '开发研究-行业研究': '242', '应用研究-政策研究': '231', '开发研究-业务研究': '244'},
                      'field': '人工标识码'},
                 'years': ['2022', '2021', '2020', '2019', '2018', '2017', '2016', '2015', '2014', '2013', '2012', '2011', '2010', '2009', '2008', '2007', '2006', '2005', '2004', '2003', '2002', '2001', '2000', '1999', '1998', '1997', '1996', '1995', '1994', '1993', '1992', '1991', '1990', '1989', '1988', '1987', '1986', '1985', '1984', '1983', '1982', '1981', '1980', '1979', '1978', '1977', '1976', '1975', '1974', '1973', '1972', '1971', '1970', '1966', '1965', '1964', '1963', '1962', '1961', '1960', '1959', '1958', '1957', '1956', '1955', '1954', '1953', '1952', '1951', '1950', '1949', '1947', '1946', '1945', '1944', '1930']}

# choice_moudle = {'subjects':
#                      {'info':
#                           {'临床医学': 'E060', '外科学': 'E066', '肿瘤学': 'E072', '中医学': 'E056', '心血管系统疾病': 'E062', '内分泌腺及全身性疾病': 'E065', '儿科学': 'E069', '神经病学': 'E070', '妇产科学': 'E068', '眼科与耳鼻咽喉科': 'E073', '泌尿科学': 'E067', '消化系统疾病': 'E064', '医药卫生方针政策与法律法规研究': 'E053', '中药学': 'E057', '急救医学': 'E077', '药学': 'E079', '感染性疾病及传染病': 'E061', '口腔科学': 'E074', '呼吸系统疾病': 'E063', '预防医学与卫生学': 'E055'},
#                       'field': '专题子栏目代码'},
#                  'study_level':
#                      {'info': {'应用研究-政策研究': '231', '开发研究-业务研究': '244'},
#                       'field': '人工标识码'},
#                  'years': ['2022', '2021', '2020', '2019', '2018', '2017', '2016', '2015', '2014', '2013', '2012', '2011', '2010', '2009', '2008', '2007', '2006', '2005', '2004', '2003', '2002', '2001', '2000', '1999', '1998', '1997', '1996', '1995', '1994', '1993', '1992', '1991', '1990', '1989', '1988', '1987', '1986', '1985', '1984', '1983', '1982', '1981', '1980', '1979', '1978', '1977', '1976', '1975', '1974', '1973', '1972', '1971', '1970', '1966', '1965', '1964', '1963', '1962', '1961', '1960', '1959', '1958', '1957', '1956', '1955', '1954', '1953', '1952', '1951', '1950', '1949', '1947', '1946', '1945', '1944', '1930']}
